export const questions = [
    {
        "title": "На столе лежат 3 яблока. Вы взяли два. Сколько яблок у вас теперь?",
        "correct": 0,
        "answers": ["2", "3", "1", "Ни одного"]
    },
    {
        "title": "Если пять машин могут произвести пять деталей за пять минут, сколько времени потребуется одной машине для производства одной детали?",
        "correct": 1,
        "answers": ["1 минута", "5 минут", "25 минут", "10 минут"]
    },
    {
        "title": "В комнате находятся 2 собаки и 4 кошки. У каждой кошки по 3 котенка. Сколько всего ног в комнате?",
        "correct": 3,
        "answers": ["14", "28", "42", "56"]
    },
    {
        "title": "Два отца и два сына нашли три монеты и решили поделить их поровну. Каждый получил по одной монете. Как это возможно?",
        "correct": 2,
        "answers": ["Они нашли ещё одну монету", "Делили не поровну", "Они составляют семью из деда, отца и внука", "Один отказался от доли"]
    },
    {
        "title": "В забеге вы обогнали второго бегуна. На каком месте вы теперь?",
        "correct": 0,
        "answers": ["На втором", "На первом", "На третьем", "На последнем"]
    },
    {
        "title": "Врач дал вам 3 таблетки и сказал принимать их каждые полчаса. Сколько времени пройдет от приема первой таблетки до последней?",
        "correct": 1,
        "answers": ["1 час", "1 час и 30 минут", "2 часа", "30 минут"]
    },
    {
        "title": "В ряду деревьев первое дерево – 1, второе – 2, третье – 3 и так далее. Какое число будет у 100-го дерева?",
        "correct": 3,
        "answers": ["99", "1000", "50", "100"]
    },
    {
        "title": "Вы участвуете в гонке. Вы обогнали последнего бегуна. На каком месте вы сейчас?",
        "correct": 3,
        "answers": ["На предпоследнем", "На последнем", "На первом", "Нельзя обогнать последнего бегуна"]
    },
    {
        "title": "Если бы вчера было завтра, то сегодня было бы пятница. Какой сегодня день недели?",
        "correct": 2,
        "answers": ["Понедельник", "Вторник", "Среда", "Четверг"]
    },
    {
        "title": "Это языковая конструкция, которая может определять участок программы для многократного повторения и количество этих повторений.",
        "correct": 0,
        "answers": ["Цикл", "Переменные", "Алгоритм", "Язык программирования"]
    },
    {
        "title": "Попробуйте установить принцип построения указанной последовательности: 8 2 9 0 1 5 7 3 4 6",
        "correct": 0,
        "answers": ["Последовательность цифр построена на основании алфавитного порядка их названий", "Цифры поставлены по случайности", "Это связана с таблицей умножением", "Сумма всех равна число ПИ"]
    },
    {
        "title": "Что такое простое число?",
        "correct": 0,
        "answers": ["Число, которое делится только на 1 и само на себя", "Число без десятичных знаков", "Число, которое делится на все предыдущие числа", "Любое число, большее 1"]
    },
    {
        "title": "Какое из чисел является простым?",
        "correct": 2,
        "answers": ["15", "21", "17", "24"]
    },
    {
        "title": "Какое число получится, если перемножить все цифры на цифровой клавиатуре телефона?",
        "correct": 1,
        "answers": ["8575", "0", "9720", "10255"]
    },
    {
        "title": "Что означает термин 'бит'?",
        "correct": 1,
        "answers": ["Восьмиугольник", "Бинарная единица", "Короткое замыкание", "Единица измерения скорости процессора"]
    },
    {
        "title": "Что такое 'баг' в программировании?",
        "correct": 0,
        "answers": ["Ошибка в программном коде", "Нейтральная единица измерения времени выполнения программы", "Специальная команда для остановки выполнения программы", "Термин для описания быстрого программного кода"]
    },
    {
        "title": "Это версия, которая может быть доработана и изменена после получения обратной связи от пользователей. Оно рабочая версия программы, не готовая к финальному запуску.",
        "correct": 0,
        "answers": ["Бета-Версия", "Не готовая программа", "Обновление", "Приложение"]
    },
    {
        "title": "Продолжите цепочку: 2, 5, 10, 17, 26, ...",
        "correct": 2,
        "answers": ["35", "36", "37", "38"]
    },
    {
        "title": "Продолжите цепочку: 3, 6, 12, 24, ...",
        "correct": 1,
        "answers": ["36", "48", "30", "40"]
    },

    {
        "title": "Логика времени: Если сейчас 4:00, что будет через 45 минут?",
        "correct": 0,
        "answers": ["4:45", "4:40", "3:55", "4:50"]
    },
    {
        "title": "Логика последовательности: Какое число следует заменить вопросительным знаком в последовательности 3, 6, 11, ?, 27",
        "correct": 2,
        "answers": ["22", "24", "18", "19"]
    },
    {
        "title": "Логика слов: Если 'star' означает 'tree', 'tree' означает 'sun', 'sun' означает 'sky', то где живут птицы?",
        "correct": 2,
        "answers": ["В звездах", "На деревьях", "В солнце", "В небе"]
    },
    {
        "title": "Логика цветов: Если красный означает синий, синий означает зеленый, зеленый означает желтый, какого цвета небо?",
        "correct": 1,
        "answers": ["Красное", "Зеленое", "Синее", "Желтое"]
    },
    {
        "title": "Логика размеров: Если маленький означает большой, а большой означает огромный, какого размера слон?",
        "correct": 0,
        "answers": ["Маленький", "Большой", "Средний", "Огромный"]
    },
    {
        "title": "Логика направлений: Если Север означает Юг, а Восток означает Запад, то куда указывает компас, показывающий на Восток?",
        "correct": 3,
        "answers": ["На Север", "На Юг", "На Восток", "На Запад"]
    },
    {
        "title": "Логика чисел: Если 1 означает 5, 2 означает 10, 3 означает 15, то чему равно 4?",
        "correct": 1,
        "answers": ["12", "20", "16", "8"]
    },
    {
        "title": "Логика знаков: Если '+' означает '-', '-' означает '*', '*' означает '/', а '/' означает '+', то что такое 4 * 2 - 2?",
        "correct": 1,
        "answers": ["2", "4", "6", "8"]
    },
    {
        "title": "Логика дней: Если понедельник означает вторник, вторник означает среду, среда означает четверг, то когда наступает выходной после пятницы?",
        "correct": 3,
        "answers": ["В среду", "В понедельник", "Во вторник", "В четверг"]
    },
    {
        "title": "Логика форм: Если круг означает квадрат, квадрат означает треугольник, треугольник означает звезду, то что такое круглая монета?",
        "correct": 1,
        "answers": ["Круглая", "Квадратная", "Треугольная", "Звездообразная"]
    }
]

